In [1]:
import pandas as pd

In [4]:
aracaju = pd.read_excel('datasets/Aracaju.xlsx')
fortaleza = pd.read_excel('datasets/Fortaleza.xlsx')
natal = pd.read_excel('datasets/Natal.xlsx')
recife = pd.read_excel('datasets/Recife.xlsx')
salvador = pd.read_excel('datasets/Salvador.xlsx')

In [7]:
df = pd.concat([aracaju, fortaleza, natal, recife, salvador])

In [8]:
# Mostrando uma amostra
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
81      Recife 2019-01-01   36.52     982     8
110     Recife 2019-03-02   51.98     983     6
69     Aracaju 2018-01-01   15.81    1523     1
94       Natal 2019-01-02   33.24    1037     1
167      Natal 2019-01-02   36.42    1037     1
176   Salvador 2019-01-02   19.42    1035     3
131  Fortaleza 2019-03-02  139.07     982     6
17       Natal 2018-02-18  276.00     854     3
196   Salvador 2019-01-02  145.09    1036     2
187      Natal 2019-01-02    3.85    1035     3

In [9]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [10]:
# alterando o tipo de uma coluna
df.LojaID = df.LojaID.astype('object')

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
# subistituindo os valores nulos pela m√©dia
df.Vendas.fillna(df.Vendas.mean(), inplace=True)

In [16]:
# subistituindo os valores nulos por zero
df.Vendas.fillna(0, inplace=True)

In [15]:
# apagando os valores nulos
df.dropna(inplace=True)

In [14]:
# apagando os valores nulos de uma coluna
df.dropna(subset=['Vendas'],inplace=True)

In [17]:
df['Receita'] = df.Vendas.mul(df.Qtde)

In [18]:
df.sample(10)

        Cidade       Data  Vendas LojaID  Qtde  Receita
1       Recife 2019-01-01   11.44    983     1    11.44
149   Salvador 2019-01-02   22.38   1034     3    67.14
139      Natal 2019-01-02  169.01   1036     1   169.01
148   Salvador 2019-01-02   40.59   1037     3   121.77
2    Fortaleza 2019-02-10   35.33   1004     3   105.99
44       Natal 2019-01-03  500.00    852     4  2000.00
58    Salvador 2019-01-01   20.64   1037     2    41.28
153   Salvador 2019-01-02   17.41   1035     2    34.82
12      Recife 2019-01-01   17.48    982     2    34.96
72   Fortaleza 2019-01-01  106.72   1003     4   426.88

In [19]:
df.Receita.max()

3544.0

In [20]:
df.nlargest(5, 'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0

In [22]:
df.nsmallest(3, 'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [23]:
df.groupby('Cidade')['Receita'].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [24]:
df.sort_values('Receita', ascending=False).head()

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0